---
type: PerformanceAdviserRuleId
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# PerformanceAdviserRuleId

`Autodesk.Revit.DB.PerformanceAdviserRuleId` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PerformanceAdviserRuleId | — | `public PerformanceAdviserRuleId ( Guid guid )` |